{"keras_version": "1.2.1", "config": [{"config": {"bias": true, "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "trainable": true, "W_constraint": null, "W_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "name": "convolution2d_1", "b_constraint": null, "b_regularizer": null, "nb_row": 5, "nb_filter": 24}, "class_name": "Convolution2D"}, {"config": {"bias": true, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activation": "relu", "W_constraint": null, "W_regularizer": null, "nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "name": "convolution2d_2", "b_constraint": null, "b_regularizer": null, "nb_filter": 36}, "class_name": "Convolution2D"}, {"config": {"bias": true, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activation": "relu", "W_constraint": null, "W_regularizer": null, "nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "subsample": [2, 2], "name": "convolution2d_3", "b_constraint": null, "b_regularizer": null, "nb_filter": 48}, "class_name": "Convolution2D"}, {"config": {"bias": true, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activation": "relu", "W_constraint": null, "W_regularizer": null, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "subsample": [1, 1], "name": "convolution2d_4", "b_constraint": null, "b_regularizer": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"bias": true, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "activation": "relu", "W_constraint": null, "W_regularizer": null, "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "subsample": [1, 1], "name": "convolution2d_5", "b_constraint": null, "b_regularizer": null, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "trainable": true, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "output_dim": 250, "input_dim": 1152, "name": "dense_1", "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"bias": true, "trainable": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "output_dim": 1, "input_dim": 250, "name": "dense_2", "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}