{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "input_dtype": "float32", "dim_ordering": "tf", "W_constraint": null, "batch_input_shape": [null, 66, 200, 3], "init": "glorot_uniform", "name": "convolution2d_1", "b_constraint": null, "nb_filter": 24, "activity_regularizer": null, "bias": true, "activation": "relu", "nb_row": 5, "border_mode": "valid", "trainable": true, "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "activity_regularizer": null, "b_constraint": null, "nb_filter": 36, "nb_row": 5, "bias": true, "activation": "relu", "border_mode": "valid", "trainable": true, "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3", "activity_regularizer": null, "b_constraint": null, "nb_filter": 48, "nb_row": 5, "bias": true, "activation": "relu", "border_mode": "valid", "trainable": true, "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_4", "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "nb_row": 3, "bias": true, "activation": "relu", "border_mode": "valid", "trainable": true, "subsample": [1, 1], "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "name": "convolution2d_5", "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "nb_row": 3, "bias": true, "activation": "relu", "border_mode": "valid", "trainable": true, "subsample": [1, 1], "nb_col": 3}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 250, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "bias": true, "trainable": true, "activation": "relu", "input_dim": 1152}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "output_dim": 1, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "bias": true, "trainable": true, "activation": "linear", "input_dim": 250}}]}