{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "b_constraint": null, "nb_row": 5, "trainable": true, "name": "convolution2d_1", "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "W_regularizer": null, "input_dtype": "float32", "bias": true, "b_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "nb_filter": 24}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "trainable": true, "name": "convolution2d_2", "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "W_regularizer": null, "nb_col": 5, "bias": true, "nb_filter": 36, "dim_ordering": "tf", "subsample": [2, 2], "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "b_constraint": null, "nb_row": 5, "trainable": true, "name": "convolution2d_3", "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "W_regularizer": null, "nb_col": 5, "bias": true, "nb_filter": 48, "dim_ordering": "tf", "subsample": [2, 2], "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "trainable": true, "name": "convolution2d_4", "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "W_regularizer": null, "nb_col": 3, "bias": true, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "trainable": true, "name": "convolution2d_5", "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "W_regularizer": null, "nb_col": 3, "bias": true, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "b_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_1", "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "W_regularizer": null, "output_dim": 250, "bias": true, "input_dim": 1152, "b_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "b_constraint": null, "trainable": true, "name": "dense_2", "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "W_regularizer": null, "output_dim": 1, "bias": true, "input_dim": 250, "b_regularizer": null}}]}